export const getLocationsForPlatoon = (platoon: string): string[] => {
  switch (platoon) {
    case 'מפג״ד':
      return ['קמ"ן', 'קש"א', 'קצין אג"ם', 'חפ"ק סמג"ד', 'קשר"ג', 'חמ"ל'];
    case 'פלס״ם':
      return ['קל"ג', 'מפ"מ', 'סמפ"מ', 'חוליית חימוש', 'רכב חילוץ', 'האמר סמפ"מ'];
    case 'תאג״ד':
      return ['האמר פתן', 'אמבולנס', 'תאג"ד רגלי'];
    case 'פלוגה א׳':
    case 'פלוגה ב׳':
    case 'פלוגה ג׳':
    case 'פלוגה ד׳':
    case 'צמ״ה 7064':
      return ['מ"פ', 'סמ"פ', 'מ"מ 1', 'מ"מ 2', 'מ"מ 3', 'חפ"ק מ"פ'];
    case 'חפק מגד וסמגד':
      return ['חפ"ק מג"ד', 'חפ"ק סמג"ד', 'קשר מג"ד', 'קשר סמג"ד'];
    case 'מחלקת קשר':
      return ['קשר"ג', 'האמר', 'רק"ש', 'מכולת קשר'];
    default:
      return ['האמר', 'רק"ש', 'נגמ"ש', 'נמ"ר', 'מכולת קשר', 'משרד'];
  }
};
